app/controllers/articles_controller.rb

  def show
    @network = Network.find_by_id(params[:network_id])
    @article = Article.find_by_id(params[:id])

    comments = @article.comments
    @top_level_comments = comments - comments.select(&:comment)
---
SELECT * FROM "networks" WHERE ("networks"."id" = '115') LIMIT 1
SELECT * FROM "articles" WHERE ("articles"."id" IS NULL) LIMIT 1
SELECT * FROM "comments" WHERE ("comments".article_id = 114)

  def new
    @network = Network.find(params[:network_id])
---
SELECT * FROM "networks" WHERE ("networks"."id" = '3') LIMIT 1

  def create
    @network = Network.find_by_id(params[:network_id])


    @article = Article.new(params[:article])
    @article.network_id = params[:network_id]
    @article.user_id = current_user.id
    @article.total_likes = (rand*100).round
    @article.total_comments = (rand*50).round

    if @article.save
---
SELECT * FROM "networks" WHERE ("networks"."id" = '3') LIMIT 1
INSERT INTO "articles" ("created_at", "title", "total_likes", "network_id", "updated_at", "url", "user_id", "total_comments", "description", "source") VALUES('2010-07-29 01:50:17', 'Ruling Against Arizona Is a Warning for Other States', 26, 8, '2010-07-29 01:50:17', 'http://www.nytimes.com/2010/07/29/us/29immig.html?_r=1&hp', 9, 26, '', 'nytimes.com')