app/controllers/memberships_controller.rb

  def create

    @membership = Membership.new(:network_id => params[:network_id], :user_id => params[:user_id])

    if @membership.save
---
INSERT INTO "memberships" ("created_at", "network_id", "updated_at", "admin", "user_id", "created_dt") VALUES('2010-07-25 20:12:18', NULL, '2010-07-25 20:12:18', NULL, NULL, NULL)

  def destroy
    @membership = Membership.find(:first, :conditions => ["network_id = :network_id and user_id = :user_id", params])
    @membership.destroy
---
SELECT * FROM "memberships" WHERE ("memberships"."network_id" = '3' AND "memberships"."user_id" = '8') LIMIT 1
DELETE FROM "memberships" WHERE "id" = 5