app/controllers/networks_controller.rb

SELECT * FROM "networks"
---
  def index
    @networks = Network.all