app/controllers/networks_controller.rb

SELECT * FROM "networks"
---
  def all_networks
    @networks = Network.all

SELECT * FROM "networks" WHERE ("networks"."id" = '3') LIMIT 1
---
  def show
    @network = Network.find_by_id(params[:id])

SELECT * FROM "networks" WHERE ("networks"."id" = 3)
---
  def members
    @network = Network.find(params[:id])

SELECT * FROM "networks" WHERE ("networks"."id" = 1)
---
  def edit
    @network = Network.find(params[:id])

INSERT INTO "networks" ("name", "created_at", "updated_at", "description") VALUES(NULL, '2010-07-25 02:40:36', '2010-07-25 02:40:36', NULL)
---
  def create
    @network = Network.new(params[:network])
    if @network.save

SELECT * FROM "networks" WHERE ("networks"."id" = 6)
UPDATE "networks" SET "updated_at" = '2010-07-26 17:53:57', "name" = 'NGOS Sustainable Innovation', "description" = 'Community of like-minded individuals interested in making a difference.' WHERE "id" = 6
---
  def update
    @network = Network.find(params[:id])

    if @network.update_attributes(params[:network])

SELECT * FROM "networks" WHERE ("networks"."id" = 2)
DELETE FROM "networks" WHERE "id" = 2
---
  def destroy
    @network = Network.find(params[:id])
    @network.destroy