app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "email") VALUES('', 'fe149e5160c2deedf142df06b75970cb3890758d', '2010-07-25 03:24:39', NULL, '4913faf6b9b26dae0ef6a846f02d54abbbd6f996', NULL, '2010-07-25 03:24:39', '3f13c0741989a0a83755a8b9ca7212972b273465', NULL, 'test_acct', 'jason.laster.11+1@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM "users" WHERE ("users"."activation_code" = '400097a987ba84634947f4f0dd152002083afd58') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?